{"class_name": "Model", "keras_version": "2.0.3", "config": {"layers": [{"name": "input_63", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "sparse": false, "name": "input_63", "dtype": "float32"}, "inbound_nodes": []}, {"name": "input_64", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "sparse": false, "name": "input_64", "dtype": "float32"}, "inbound_nodes": []}, {"name": "embedding_63", "class_name": "Embedding", "config": {"input_dim": 3953, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "dtype": "int32", "batch_input_shape": [null, null], "input_length": null, "activity_regularizer": null, "mask_zero": false, "name": "embedding_63", "trainable": true, "embeddings_constraint": null, "output_dim": 50, "embeddings_regularizer": null}, "inbound_nodes": [[["input_63", 0, 0, {}]]]}, {"name": "embedding_64", "class_name": "Embedding", "config": {"input_dim": 6041, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "dtype": "int32", "batch_input_shape": [null, null], "input_length": null, "activity_regularizer": null, "mask_zero": false, "name": "embedding_64", "trainable": true, "embeddings_constraint": null, "output_dim": 50, "embeddings_regularizer": null}, "inbound_nodes": [[["input_64", 0, 0, {}]]]}, {"name": "flatten_63", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_63"}, "inbound_nodes": [[["embedding_63", 0, 0, {}]]]}, {"name": "flatten_64", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_64"}, "inbound_nodes": [[["embedding_64", 0, 0, {}]]]}, {"name": "dropout_63", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_63", "rate": 0.12}, "inbound_nodes": [[["flatten_63", 0, 0, {}]]]}, {"name": "dropout_64", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_64", "rate": 0.12}, "inbound_nodes": [[["flatten_64", 0, 0, {}]]]}, {"name": "dot_32", "class_name": "Dot", "config": {"trainable": true, "axes": 1, "name": "dot_32", "normalize": false}, "inbound_nodes": [[["dropout_63", 0, 0, {}], ["dropout_64", 0, 0, {}]]]}], "input_layers": [["input_63", 0, 0], ["input_64", 0, 0]], "name": "model_38", "output_layers": [["dot_32", 0, 0]]}, "backend": "theano"}