{"backend": "theano", "keras_version": "2.0.3", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "batch_input_shape": [null, 1, 48, 48], "bias_regularizer": null, "padding": "same", "strides": [1, 1], "name": "conv2d_1", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "filters": 32, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "name": "conv2d_2", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "filters": 64, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "name": "conv2d_3", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "filters": 64, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "name": "conv2d_4", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "filters": 128, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.25}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "name": "conv2d_5", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "filters": 128, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.3}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "name": "conv2d_6", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "filters": 256, "data_format": "channels_first", "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.35}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "strides": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1024, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.45}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 7, "activity_regularizer": null, "bias_constraint": null}}]}