{"keras_version": "2.0.3", "class_name": "Sequential", "backend": "theano", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "input_length": 312, "activity_regularizer": null, "batch_input_shape": [null, 312], "mask_zero": false, "output_dim": 300, "dtype": "int32", "trainable": false, "input_dim": 51934, "name": "embedding_1", "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}}}, {"class_name": "GRU", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "go_backwards": false, "return_sequences": true, "units": 512, "use_bias": true, "name": "gru_1", "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "dropout": 0.4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.4, "unroll": false, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 2, "activation": "tanh", "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "GRU", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "go_backwards": false, "return_sequences": true, "units": 256, "use_bias": true, "name": "gru_2", "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "dropout": 0.4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.4, "unroll": false, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 2, "activation": "tanh", "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "GRU", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "go_backwards": false, "return_sequences": false, "units": 128, "use_bias": true, "name": "gru_3", "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "dropout": 0.4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.4, "unroll": false, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 2, "activation": "tanh", "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 256, "use_bias": true, "activation": "relu", "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 256, "use_bias": true, "activation": "relu", "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 39, "use_bias": true, "activation": "sigmoid", "name": "dense_3", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}